In [1]:
%load_ext sql

In [2]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [3]:
%%sql
Drop table if exists sales;
create table sales 
(
    id int,
    product string,
    salesyear string,
    quantitysold int
);

 * sqlite:///./test.db
Done.
Done.

[]

In [6]:
%%sql insert into sales values
(1,'Laptop','1998',2500),
(2,'Laptop','1999',3600),
(3,'Laptop','2000',4200),
(4,'Keyboard','1998',2300),
(5,'Keyboard','1999',4800),
(6,'Keyboard','2000',5000),
(7,'mouse','1998',6000),
(8,'mouse','1999',3400),
(9,'mouse','2000',4600);

 * sqlite:///./test.db
9 rows affected.

[]

In [7]:
%sql select * from sales

 * sqlite:///./test.db
Done.

[(1, 'Laptop', 1998, 2500),
 (2, 'Laptop', 1999, 3600),
 (3, 'Laptop', 2000, 4200),
 (4, 'Keyboard', 1998, 2300),
 (5, 'Keyboard', 1999, 4800),
 (6, 'Keyboard', 2000, 5000),
 (7, 'mouse', 1998, 6000),
 (8, 'mouse', 1999, 3400),
 (9, 'mouse', 2000, 4600)]

SQL to get total sales for year 1998,1999,2000 for all products column wise

In [14]:
%%sql 
select 'total sales' total_sales,sum(`1998_sales`) '1998',sum(`1999_sales`) '1999',sum(`2000_sales`) '2000' from (
select case when salesyear='1998' then quantitysold else 0 end '1998_sales',
            case when salesyear='1999' then quantitysold else 0 end '1999_sales',
            case when salesyear='2000' then quantitysold else 0 end '2000_sales'
from sales )x

 * sqlite:///./test.db
Done.

[('total sales', 10800, 11800, 13800)]

### Using Pivot

select 'totalslaes' totalsales,`1998`,`1999`,`2000` from
(select quantitysold,salesyear from sales) p
pivot (
sum(quantitysold)
    for salesyear in (1998,1999,2000)
) as PivotTable